In [5]:
import pandas as pd

df = pd.read_csv("students_basic_30.csv")

print(df.head())

   name  age  score
0  Andi   22     65
1  Budi   23     75
2  Cici   18     60
3  Dian   21     78
4   Eko   21     95

In [9]:
df.iloc[2]["name"]

'Cici'

In [10]:
df[df["score"] > 80]

     name  age  score
4     Eko   21     95
5   Fajar   21     84
6    Gina   19     89
10   Kiki   22     99
11   Lina   24     92
14    Oki   22     92
15  Putri   20     91
17   Rama   24     83
18   Sari   24     95
20    Uli   19     88
21   Vito   23     94
24  Yusuf   18     96
26   Aldi   22     98

In [11]:
df[df["age"] < 21]

      name  age  score
2     Cici   18     60
6     Gina   19     89
9     Joko   20     74
12    Made   18     61
13     Nia   18     69
15   Putri   20     91
16    Qori   19     70
19    Tono   18     71
20     Uli   19     88
22   Wulan   19     60
24   Yusuf   18     96
25   Zahra   19     65
28  Candra   18     75

In [15]:
df[(df["score"] >= 70) & (df["score"] < 90)]

      name  age  score
1     Budi   23     75
3     Dian   21     78
5    Fajar   21     84
6     Gina   19     89
7     Hadi   21     79
8    Indah   23     79
9     Joko   20     74
16    Qori   19     70
17    Rama   24     83
19    Tono   18     71
20     Uli   19     88
27   Bella   21     77
28  Candra   18     75

In [18]:
df.groupby("name")["score"].sum().sort_values(ascending=False)

name
Kiki      99
Aldi      98
Yusuf     96
Sari      95
Eko       95
Vito      94
Lina      92
Oki       92
Putri     91
Gina      89
Uli       88
Fajar     84
Rama      83
Hadi      79
Indah     79
Dian      78
Bella     77
Budi      75
Candra    75
Joko      74
Tono      71
Qori      70
Nia       69
Zahra     65
Andi      65
Dewi      64
Made      61
Cici      60
Xena      60
Wulan     60
Name: score, dtype: int64